app/views/jobs/edit.html.erb

SELECT "categories"."category" FROM "categories"
---
      <%= f.input :deadline %>
      <%= f.input :category, collection: Category.pluck(:category) %>