app/views/jobs/new.html.erb

SELECT "categories"."category" FROM "categories"
---
      <%= f.input :deadline, label: 'deadline (YYYY-MM-DD)' %>
      <%= f.input :category, collection: Category.pluck(:category) %>