app/views/employers/index.html.erb

<%= table_for @employer, class: 'table' do |t| %>
  <% t.column :emp_name, 'Employer' %>
---
SELECT "employers".* FROM "employers"