app/controllers/admins_controller.rb

  def create
    @admin = Admin.new(admin_params)
    if @admin.save
---
INSERT INTO "admins" ("created_at", "email", "encrypted_password", "name", "password", "salt", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def show
    session[:admin] = request.original_url
    @admin = Admin.find(params[:id])
---
SELECT  "admins".* FROM "admins"  WHERE "admins"."id" = ? LIMIT 1  [["id", 1]]

  def edit
    @admin= Admin.find(params[:id])
---
SELECT  "admins".* FROM "admins"  WHERE "admins"."id" = ? LIMIT 1  [["id", 1]]

  def update
    @admin = Admin.find(params[:id])
    if @admin.update_attributes(params[:admin].permit(:password))
---
SELECT  "admins".* FROM "admins"  WHERE "admins"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "admins" SET "encrypted_password" = ?, "password" = ?, "salt" = ?, "updated_at" = ? WHERE "admins"."id" = 1