app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("category", "created_at", "updated_at") VALUES (?, ?, ?)  [["category", "Computer Science"], ["created_at", "2014-09-26 23:34:28.960858"], ["updated_at", "2014-09-26 23:34:28.960858"]]