app/controllers/employers_controller.rb

SELECT "employers".* FROM "employers"
---
  def index
    @title = "All Employers in System"
    #@jobs = Job.paginate(:page => params[:page])
    @employer = Employer.all

INSERT INTO "employers" ("contact_person", "created_at", "email", "emp_name", "encrypted_password", "password", "salt", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @employer = Employer.new(employer_params)
    if @employer.save

SELECT  "employers".* FROM "employers"  WHERE "employers"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @employer = Employer.find(params[:id])

SELECT  "employers".* FROM "employers"  WHERE "employers"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @employer = Employer.find(params[:id])

SELECT  "employers".* FROM "employers"  WHERE "employers"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "employers" SET "encrypted_password" = ?, "password" = ?, "salt" = ?, "updated_at" = ? WHERE "employers"."id" = 1
---
  def update
    @employer = Employer.find(params[:id])
    if @employer.update_attributes(params[:employer].permit(:password))