app/controllers/jobapplications_controller.rb

  def index
    @title = "All Jobs You have Applied"
    @jobapplications = Jobapplication.where('email = ?', session[:userEmail])
---
SELECT "jobapplications".* FROM "jobapplications"  WHERE (email = 'sg@gmail.com')

  def indexEmp
    @title = "All Jobs Applied"
    #@jobapplications = Jobapplication.paginate(:page => params[:page])
    @jobapplications = Jobapplication.where('emp_name = ?',session[:emp_name])
---
SELECT "jobapplications".* FROM "jobapplications"  WHERE (emp_name = 'Google')

  def create
    @jobapplication = Jobapplication.new(jobapplication_params)
    if @jobapplication.save
---
INSERT INTO "jobapplications" ("created_at", "email", "emp_name", "job_ID", "status", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2014-09-26 23:51:20.098299"], ["email", "sg@gmail.com"], ["emp_name", "Google"], ["job_ID", "12345"], ["status", "Pending"], ["updated_at", "2014-09-26 23:51:20.098299"]]

  def edit
    @jobapplication = Jobapplication.find(params[:id])
---
SELECT  "jobapplications".* FROM "jobapplications"  WHERE "jobapplications"."id" = ? LIMIT 1  [["id", 3]]

  def update
    @jobapplication = Jobapplication.find(params[:id])
    if @jobapplication.update_attributes(params[:jobapplication].permit(:status))
---
SELECT  "jobapplications".* FROM "jobapplications"  WHERE "jobapplications"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "jobapplications" SET "status" = ?, "updated_at" = ? WHERE "jobapplications"."id" = 3  [["status", "Not A Fit"], ["updated_at", "2014-09-27 00:10:23.085556"]]

  def destroy
    Jobapplication.find(params[:id]).destroy
---
DELETE FROM "jobapplications" WHERE "jobapplications"."id" = ?  [["id", 1]]
SELECT  "jobapplications".* FROM "jobapplications"  WHERE "jobapplications"."id" = ? LIMIT 1  [["id", 1]]