app/controllers/jobs_controller.rb

  def recommend
    Jobapplication.all.each do|user|
---
SELECT "jobapplications".* FROM "jobapplications"