app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("coverLetter", "created_at", "email", "encrypted_password", "name", "phone_no", "resume", "salt", "skills", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 2 LIMIT 1
UPDATE "users" SET "phone_no" = ?, "updated_at" = ? WHERE "users"."id" = 2  [["phone_no", "22222222222"], ["updated_at", "2014-09-26 23:49:46.150356"]]