app/views/application/_nav.html.erb

        <ul class="nav navbar-nav">
          <% admin_user = Admin.find_by email: session[:adminEmail] %>
---
SELECT  "admins".* FROM "admins"  WHERE "admins"."email" = 'andrew@andrew.com' LIMIT 1


          <% employer_user = Employer.find_by email: session[:employerEmail] %>
---
SELECT  "employers".* FROM "employers"  WHERE "employers"."email" = 'andrew@andrew.com' LIMIT 1


          <% @user = User.find_by email: session[:userEmail] %>
---
SELECT  "users".* FROM "users"  WHERE "users"."email" = 'andrew@andrew.com' LIMIT 1